package com.nantian.common.util;

public class LogConst {

    /** ���O���b�Z�[�WNO: _5003I */
    public static final String M_5003 = "_5003I";

    /** ���O���b�Z�[�WNO: _5004I */
    public static final String M_5004 = "_5004I";

    /** �����J�n[$0] */
    public static final String M_1001 = "_1001I";

    /** �����I��[$0] */
    public static final String M_1002 = "_1002I";

    /** �Ɖ��[$0]�� */
    public static final String M_1003 = "_1003I";

    /** �Y�����R�[�h0�� */
    public static final String M_1004 = "_1004E";

    /** �Ɖ�ʌ����I�[�o�[ ���ʌ���[$0] �b�r�u�o�͏���l[$1] */
    public static final String M_1005 = "_1005E";

    /** �v���p�e�B�L�[�Y���Ȃ� �v���p�e�B�L�[[$0] */
    public static final String M_1006 = "_1006E";

    /** �v���p�e�B�l���l�����s �v���p�e�B�L�[[$0] �l[$1] */
    public static final String M_1007 = "_1007E";

    /** �o�͂b�r�u�t�@�C�������łɑ��݂��܂� [$0] */
    public static final String M_1008 = "_1008E";

    /** �ėp�}�X�^�Y���Ȃ� �L�[�R�[�h[$0] �ėp�h�c[$1] */
    public static final String M_1009 = "_1009E";

    /** �w�b�_�`�F�b�N�G���[ */
    public static final String M_1010 = "_1010E";

    /** �ُ�I��[$0] */
    public static final String M_1011 = "_1011E";

    /** �Ǎ������F$0�@�������F$1�@���퐔�F$2�@���[�j���O���F$3�@�G���[���F$4 */
    public static final String M_1012 = "_1012I";

    /** �}�X�^�Ƀ��R�[�h�����݂��܂��� �e�[�u��ID[$0] ����[$1] */
    public static final String M_1013 = "_1013E";

    /** �J�����|�W�g�������݂��Ă��܂��B[&0}�@�폜���Ă��������B */
    public static final String M_1014 = "_1014E";

    /** �A���G���[�J�E���g�����e�񐔂𒴂��܂����B */
    public static final String M_1015 = "_1015E";

    /** $0.$1�F�J�n���܂��� */
    public static final String M_1016 = "_1016I";

    /** $0.$1�F�I��[$2]���܂��� */
    public static final String M_1017 = "_1017I";

    /** �t�@�C�����F$0 */
    public static final String M_1018 = "_1018I";

    /** ���R�[�h�F$0 */
    public static final String M_1019 = "_1019I";

    /** [$0�v�Ɏ��s���܂����B�G���[���e�F[$0] */
    public static final String M_1020 = "_1020E";

    /**  */
    public static final String M_1021 = "_1021E";

    /** SQLID[$0]���Ăяo�� */
    public static final String M_5005 = "_5005I";

    /** SQLID[$0]��߂�[�����F$1] */
    public static final String M_5006 = "_5006I";

    /** [$0]���ݒ肳��Ă��܂���B */
    public static final String M_5008 = "_5008E";

    /** [$0]�����݂��Ă��܂���B */
    public static final String M_5009 = "_5009E";

    /** [$0]���s���ł��B */
    public static final String M_5010 = "_5010E";

    /** �����F�y $0 = $1 �z */
    public static final String DEBUG001 = "�����F�y $0 = $1 �z";

    /** �����F�y $0 = $1 $2 = $3 �z */
    public static final String DEBUG002 = "�����F�y $0 = $1, $2 = $3 �z";

    /** �����F�y $0 = $1 $2 = $3 $4 = $5 �z */
    public static final String DEBUG003 = "�����F�y $0 = $1, $2 = $3, $4 = $5 �z";

    /** �����F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 �z */
    public static final String DEBUG004 = "�����F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7 �z";

    /** �����F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 $8 = $9 �z */
    public static final String DEBUG005 = "�����F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9 �z";

    /** �����F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 $8 = $9 $10 = $11 �z */
    public static final String DEBUG006 = "�����F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11 �z";

    /** ��͈�F�y $0 = $1 �z */
    public static final String DEBUG011 = "��͈�F�y $0 = $1 �z";

    /** ��͈�F�y $0 = $1 $2 = $3 �z */
    public static final String DEBUG012 = "��͈�F�y $0 = $1, $2 = $3 �z";

    /** ��͈�F�y $0 = $1 $2 = $3 $4 = $5 �z */
    public static final String DEBUG013 = "��͈�F�y $0 = $1, $2 = $3, $4 = $5 �z";

    /** ��͈�F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 �z */
    public static final String DEBUG014 = "��͈�F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7 �z";

    /** ��͈�F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 $8 = $9 �z */
    public static final String DEBUG015 = "��͈�F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9 �z";

    /** ��͈�F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 $8 = $9 $10 = $11 �z */
    public static final String DEBUG016 = "��͈�F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11 �z";

    /** ��͈�F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 $8 = $9 $10 = $11 $12 = $13�z */
    public static final String DEBUG017 = "��͈�F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11, $12 = $13 �z";

    /** ��͈�F�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 $8 = $9 $10 = $11 �z */
    public static final String DEBUG019 = "��͈�F�y $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11, $12 = $13, $14 = $15, $16 = $17 �z";

    /** �o�͌��ʁF�y $0 = $1 �z */
    public static final String DEBUG021 = "�o�͌��ʁF�y $0 = $1 �z";

    /** �o�͌��ʁF�y $0 = $1 $2 = $3 �z */
    public static final String DEBUG022 = "�o�͌��ʁF�y $0 = $1, $2 = $3 �z";

    /** �o�͌��ʁF�y $0 = $1 $2 = $3 $4 = $5�z */
    public static final String DEBUG023 = "�o�͌��ʁF�y $0 = $1, $2 = $3, $4 = $5 �z";

    /** �o�͌��ʁF�y $0 = $1 $2 = $3 $4 = $5 $6 = $7�z */
    public static final String DEBUG024 = "�o�͌��ʁF�y $0 = $1, $2 = $3, $4 = $5, $6 = $7 �z";

    /** �o�͌��ʁF�y $0 = $1 $2 = $3 $4 = $5 $6 = $7 $8 = $9�z */
    public static final String DEBUG025 = "�o�͌��ʁF�y $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9 �z";
    
    /** 循环处理：开始 */
    public static final String DEBUG_LOOP_START = "循环处理：开始";
    
    /** 循环处理：完成 */
    public static final String DEBUG_LOOP_END = "循环处理：完成";
    
    /**循环处理：循环变量【 $0 = $1 】 */
    public static final String DEBUG_LOOP_ITER_01 = "循环处理：循环变量【 $0 = $1 】";
    
    /** 循环处理：循环变量【 $0 = $1, $2 = $3 】 */
    public static final String DEBUG_LOOP_ITER_02 = "循环处理：循环变量【 $0 = $1, $2 = $3 】";
    
    /** 循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5 】 */
    public static final String DEBUG_LOOP_ITER_03 = "循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5 】 ";
    
    /** 循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7 】 */
    public static final String DEBUG_LOOP_ITER_04 = "循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7 】 ";
    
    /** 循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9 】 */
    public static final String DEBUG_LOOP_ITER_05 = "循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9 】";
    
    /** 循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11 】 */
    public static final String DEBUG_LOOP_ITER_06 = "循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11 】";
    
    /** 循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11, $12 = $135 】 */
    public static final String DEBUG_LOOP_ITER_07 = "循环处理：循环变量【 $0 = $1, $2 = $3, $4 = $5, $6 = $7, $8 = $9, $10 = $11, $12 = $135 】";
    
    /** 循环处理：循环最大次数 = $0 */
    public static final String DEBUG_LOOP_NUM = "循环处理：循环最大次数 = $0 ";
    
    /** 循环处理：循环变量 $0:类名、$1:方法名、$2:循环次数、$3:变量值 */
    public static final String DEBUG_LOOP_NUM_VAL = "$0.$1: [$2]$3";

}
